import React from 'react'
import './Section5.scss'

const Section5 = () => {
  return (
    <div className='Section5'>
        <div className="container">
            <h1>
                <span>Лучшие</span> товары
            </h1>
            <p>
                От ведущих мировых брендов
            </p>
            <div className="brands">
                <div className="brand">
                    <img src="./images/img1.png" alt="img1" />
                </div>
                <div className="brand">
                    <img src="./images/img2.png" alt="img2" />
                </div>
                <div className="brand">
                    <img src="./images/img3.png" alt="img3" />
                </div>
                <div className="brand">
                    <img src="./images/img4.png" alt="img4" />
                </div>
                <div className="brand">
                    <img src="./images/img5.png" alt="img5" />
                </div>
                <div className="brand">
                    <img src="./images/img6.png" alt="img6" />
                </div>
                <div className="brand">
                    <img src="./images/img7.png" alt="img7" />
                </div>
                <div className="brand">
                    <img src="./images/img8.png" alt="img8" />
                </div>
                <div className="brand">
                    <img src="./images/img9.png" alt="img9" />
                </div>
                <div className="brand">
                    <img src="./images/img10.png" alt="img10" />
                </div>
            </div>
            <div className="map">
                <div className="map__contact">
                    <h1>
                        Контакты
                    </h1>
                    <p>
                        Оптовый поставщик «Султан»
                    </p>
                    <div className="map__contact__connect">
                        <div className="box">
                            <h5>
                                Адрес:
                            </h5>
                            <div className="down">
                                <div className="down__left">
                                    <svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M7.99992 0.666748C6.23181 0.666748 4.53612 1.36913 3.28587 2.61937C2.03563 3.86961 1.33325 5.5653 1.33325 7.33342C1.33325 8.91008 1.66825 9.94175 2.58325 11.0834L7.99992 17.3334L13.4166 11.0834C14.3316 9.94175 14.6666 8.91008 14.6666 7.33342C14.6666 5.5653 13.9642 3.86961 12.714 2.61937C11.4637 1.36913 9.76803 0.666748 7.99992 0.666748V0.666748Z" stroke="#3F4E65" stroke-width="1.3" stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>
                                </div>
                                <div className="down__right">
                                    г. Кокчетав, ул. Ж. Ташенова 129Б <br />
                                    (Рынок Восточный)
                                </div>
                            </div>
                        </div>
                        <div className="box">
                            <h5>
                                Отдел продаж:
                            </h5>
                            <div className="down">
                                <div className="down__left">
                                    <svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M3.25 0.25C2.58696 0.25 1.95107 0.513392 1.48223 0.982233C1.01339 1.45107 0.75 2.08696 0.75 2.75V15.25C0.75 15.913 1.01339 16.5489 1.48223 17.0178C1.95107 17.4866 2.58696 17.75 3.25 17.75H10.75C11.413 17.75 12.0489 17.4866 12.5178 17.0178C12.9866 16.5489 13.25 15.913 13.25 15.25V5.7675C13.2496 5.27039 13.0517 4.79379 12.7 4.4425L9.05875 0.79875C8.88455 0.624667 8.67777 0.486604 8.45021 0.392449C8.22265 0.298293 7.97877 0.249889 7.7325 0.25H3.25ZM2 2.75C2 2.41848 2.1317 2.10054 2.36612 1.86612C2.60054 1.6317 2.91848 1.5 3.25 1.5H7V4.625C7 5.12228 7.19754 5.59919 7.54917 5.95083C7.90081 6.30246 8.37772 6.5 8.875 6.5H12V15.25C12 15.5815 11.8683 15.8995 11.6339 16.1339C11.3995 16.3683 11.0815 16.5 10.75 16.5H3.25C2.91848 16.5 2.60054 16.3683 2.36612 16.1339C2.1317 15.8995 2 15.5815 2 15.25V2.75ZM11.7413 5.25H8.875C8.70924 5.25 8.55027 5.18415 8.43306 5.06694C8.31585 4.94973 8.25 4.79076 8.25 4.625V1.75875L11.7413 5.25Z" fill="#3F4E65"/>
                                    </svg>
                                </div>
                                <div className="down__right">
                                    +7 (777) 490-00-91 <br />
                                    opt.sultan@mail.ru
                                </div>
                            </div>
                        </div>
                    
                        <div className="box">
                            <h5>
                                Данные налогоплательщика:
                            </h5>
                            <div className="down">
                                <div className="down__left">
                                    <svg width="18" height="14" viewBox="0 0 18 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M3.37508 0.333252H14.6251C15.3169 0.333207 15.9824 0.59788 16.4853 1.07298C16.9881 1.54808 17.2901 2.19758 17.3293 2.88825L17.3334 3.04158V10.9583C17.3335 11.65 17.0688 12.3156 16.5937 12.8184C16.1186 13.3213 15.4691 13.6233 14.7784 13.6624L14.6251 13.6666H3.37508C2.6833 13.6666 2.01772 13.402 1.51489 12.9269C1.01205 12.4518 0.71008 11.8023 0.670915 11.1116L0.666748 10.9583V3.04158C0.666703 2.3498 0.931376 1.68423 1.40647 1.18139C1.88157 0.678558 2.53108 0.376584 3.22175 0.337419L3.37508 0.333252H14.6251H3.37508ZM16.0834 4.81075L9.29175 8.38575C9.21506 8.42626 9.13078 8.45037 9.04427 8.45654C8.95776 8.46271 8.87091 8.4508 8.78925 8.42159L8.70925 8.38658L1.91675 4.81158V10.9583C1.91676 11.3242 2.05439 11.6768 2.30231 11.9461C2.55024 12.2153 2.89033 12.3815 3.25508 12.4116L3.37508 12.4166H14.6251C14.9912 12.4166 15.3439 12.2788 15.6132 12.0307C15.8824 11.7826 16.0485 11.4423 16.0784 11.0774L16.0834 10.9583V4.81075ZM14.6251 1.58325H3.37508C3.00909 1.58327 2.65648 1.72089 2.38726 1.96882C2.11803 2.21674 1.95186 2.55683 1.92175 2.92159L1.91675 3.04158V3.39908L9.00008 7.12659L16.0834 3.39825V3.04158C16.0834 2.67546 15.9456 2.32274 15.6975 2.0535C15.4494 1.78425 15.1091 1.61817 14.7442 1.58825L14.6251 1.58325Z" fill="#3F4E65"/>
                                    </svg>
                                </div>
                                <div className="down__right">
                                    ИП Катран Д.С. <br />
                                    ИИН: 860113450858
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>    
    </div>
  )
}

export default Section5