import React from 'react'
import { useInfoContext } from '../../Context/InfoContext'
import './CorzinaCard.scss'

const CorzinaCard = () => {
    const {products, setProducts, price, prodBalance, setProdBalance} = useInfoContext()
    const plus = () =>{
        setProducts(prev => prev + 1)
        setProdBalance(prev => prev + 1 * price)
      }
      const minus = () =>{
        setProducts(prev => prev - 1)
        setProdBalance(prev => prev - 1 * price)
      }
      const cleanProd = () => {
        setProducts(prev => prev = 0)
        setProdBalance(prev => prev = 0)
      }
    return (
        <div className='CorzinaCard'>
            <div className="corzinaCard__img">
                <img src="./images/product.png" alt="product" />
            </div>
            <div className="corzinaCard__description">
                <div className="weight">
                    <svg width="20" height="15" viewBox="0 0 20 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M13.303 7.99994C12.7749 7.99994 12.278 7.71869 12.0092 7.26869L9.99986 3.93743L7.99361 7.26869C7.72173 7.72181 7.22486 8.00306 6.69673 8.00306C6.55611 8.00306 6.41548 7.98431 6.28111 7.94369L1.99986 6.71868V12.2812C1.99986 12.7406 2.31236 13.1406 2.75611 13.2499L9.51236 14.9406C9.83111 15.0187 10.1655 15.0187 10.4811 14.9406L17.2436 13.2499C17.6874 13.1374 17.9999 12.7374 17.9999 12.2812V6.71868L13.7186 7.94056C13.5842 7.98119 13.4436 7.99994 13.303 7.99994ZM19.9467 4.49369L18.3374 1.28118C18.2405 1.08743 18.0311 0.974934 17.8155 1.00306L9.99986 1.99993L12.8655 6.75306C12.9842 6.94993 13.2217 7.04368 13.4436 6.98118L19.628 5.21556C19.9374 5.12493 20.0874 4.78118 19.9467 4.49369ZM1.66236 1.28118L0.0529828 4.49369C-0.0907672 4.78118 0.0623578 5.12493 0.368608 5.21243L6.55298 6.97806C6.77486 7.04056 7.01236 6.94681 7.13111 6.74993L9.99986 1.99993L2.18111 1.00306C1.96548 0.978059 1.75923 1.08743 1.66236 1.28118Z" fill="#3F4E65"/>
                    </svg>
                    <span>   90 г</span>
                </div>
                <h2>AOS средство для мытья посуды Crystal</h2>
                <p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam interdum ut <br /> justo, vestibulum sagittis iaculis iaculis. Quis mattis vulputate feugiat massa <br /> vestibulum duis. </p>
            </div>
            <div className="corzinaCard__function d-flex">                
                <div className="adding__btns d-flex">
                    <button type='button'  onClick={minus} className="btns">
                    -
                    </button>
                    <span className='num'>
                    {products}
                    </span>
                    <button type='button' onClick={plus} className="btns">
                    +
                    </button>
                </div>            
                <span className='price'>{prodBalance}  ₸</span>
                <button onClick={cleanProd} className="trash-btn">
                    <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M12.625 3.25H17.3125C17.5197 3.25 17.7184 3.33231 17.8649 3.47882C18.0114 3.62534 18.0938 3.82405 18.0938 4.03125C18.0938 4.23845 18.0114 4.43716 17.8649 4.58368C17.7184 4.73019 17.5197 4.8125 17.3125 4.8125H16.4484L15.2734 15.4C15.1673 16.3555 14.7125 17.2384 13.9961 17.8795C13.2797 18.5207 12.352 18.8751 11.3906 18.875H7.60938C6.64797 18.8751 5.72029 18.5207 5.00389 17.8795C4.28749 17.2384 3.8327 16.3555 3.72656 15.4L2.55 4.8125H1.6875C1.4803 4.8125 1.28159 4.73019 1.13507 4.58368C0.98856 4.43716 0.90625 4.23845 0.90625 4.03125C0.90625 3.82405 0.98856 3.62534 1.13507 3.47882C1.28159 3.33231 1.4803 3.25 1.6875 3.25H6.375C6.375 2.4212 6.70424 1.62634 7.29029 1.04029C7.87634 0.45424 8.6712 0.125 9.5 0.125C10.3288 0.125 11.1237 0.45424 11.7097 1.04029C12.2958 1.62634 12.625 2.4212 12.625 3.25ZM9.5 1.6875C9.0856 1.6875 8.68817 1.85212 8.39515 2.14515C8.10212 2.43817 7.9375 2.8356 7.9375 3.25H11.0625C11.0625 2.8356 10.8979 2.43817 10.6049 2.14515C10.3118 1.85212 9.9144 1.6875 9.5 1.6875ZM7.15625 7.9375V14.1875C7.15625 14.3947 7.23856 14.5934 7.38507 14.7399C7.53159 14.8864 7.7303 14.9688 7.9375 14.9688C8.1447 14.9688 8.34341 14.8864 8.48993 14.7399C8.63644 14.5934 8.71875 14.3947 8.71875 14.1875V7.9375C8.71875 7.7303 8.63644 7.53159 8.48993 7.38507C8.34341 7.23856 8.1447 7.15625 7.9375 7.15625C7.7303 7.15625 7.53159 7.23856 7.38507 7.38507C7.23856 7.53159 7.15625 7.7303 7.15625 7.9375ZM11.0625 7.15625C10.8553 7.15625 10.6566 7.23856 10.5101 7.38507C10.3636 7.53159 10.2812 7.7303 10.2812 7.9375V14.1875C10.2812 14.3947 10.3636 14.5934 10.5101 14.7399C10.6566 14.8864 10.8553 14.9688 11.0625 14.9688C11.2697 14.9688 11.4684 14.8864 11.6149 14.7399C11.7614 14.5934 11.8438 14.3947 11.8438 14.1875V7.9375C11.8438 7.7303 11.7614 7.53159 11.6149 7.38507C11.4684 7.23856 11.2697 7.15625 11.0625 7.15625Z" fill="white"/>
                    </svg>
                </button>
            </div>
        </div>
    )
}

export default CorzinaCard